olx2.0/app/controllers/items_controller.rb

SELECT `items`.* FROM `items`
SELECT `items`.* FROM `items` WHERE `items`.`user_id` = 1
---
  def index
    @items = Item.all
    @f=Item.where(:user_id => current_user.id)

INSERT INTO `items` (`title`, `description`, `name`, `phno`, `city`, `created_at`, `updated_at`, `image`, `user_id`) VALUES ('chaddi', 'xxxl', 'deepak', 9649678300, 'MEERUT', '2019-01-11 19:29:36', '2019-01-11 19:29:36', 'WhatsApp_Image_2018-11-30_at_7.56.38_PM.jpeg', 3)
---
  def create
    @item = Item.new(item_params)
    @item.user_id=current_user.id

    respond_to do |format|
      if @item.save

UPDATE `items` SET `price` = 5444, `updated_at` = '2019-01-13 09:18:59' WHERE `items`.`id` = 2
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM `items` WHERE `items`.`id` = 3
---
  def destroy
    @item.destroy