assingment/app/controllers/complain_lists_controller.rb

  def index
    if current_user.admin?
      @complain_lists = ComplainList.all
    else
      @complain_lists = ComplainList.where(:user_id => current_user.id)
---
SELECT `complain_lists`.* FROM `complain_lists`
SELECT `complain_lists`.* FROM `complain_lists` WHERE `complain_lists`.`user_id` = 1

  def create
    @complain_list = ComplainList.new(complain_list_params)
    @complain_list.user_id=current_user.id
    respond_to do |format|
      if @complain_list.save
---
INSERT INTO `complain_lists` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('lol', 'extra lol', '2019-01-05 13:15:06', '2019-01-05 13:15:06', 3)

    def set_complain_list
      @complain_list = ComplainList.find(params[:id])
---
SELECT  `complain_lists`.* FROM `complain_lists` WHERE `complain_lists`.`id` = 1 LIMIT 1